function add_new_row() {
    var tr = document.createElement('tr');
    var td = document.createElement('td');
    td.innerHTML = "Новая строка";
    tr.appendChild(td);
    document.getElementById('tb').appendChild(tr);
}

/*
** Функция получает все данные
 */
function get_json() {
    /*
    var ajax = new XMLHttpRequest();
    ajax.open('GET', 'http://smart-route.ru:8100/adapter-web/rest/dictionary/c580d006-f86f-4bdd-84be-b51de6f626c6', false);
    ajax.send();
    var response = ajax.responseText;
    */
    var response = '{"id":"c580d006-f86f-4bdd-84be-b51de6f626c6","name":"RandomPeoples","documents":[{"fio":"Русова Милица Федоровна","gender":"w","birthDate":"6 июля 1993","phone":"8-959-265-71-83"},{"fio":"Сморчков Дементий Егорович","gender":"m","birthDate":"16 февраля 1980","phone":"8-902-229-77-35"},{"fio":"Воробьёв Филарет Вячеславович","gender":"w","birthDate":"6 октября 1981","phone":"8-929-797-98-43"},{"fio":"Воронец Глафира Александровна","gender":"m","birthDate":"17 февраля 1969","phone":"8-966-187-77-59"},{"fio":"Ерофеева Ульяна Ефимовна","gender":"w","birthDate":"18 августа 1973","phone":"8-926-764-42-92"},{"fio":"Миронова Вероника Николаевна","gender":"m","birthDate":"29 марта 1983","phone":"8-944-810-95-48"},{"fio":"Куколевская Варвара Андреевна","gender":"w","birthDate":"15 августа 1971","phone":"8-913-783-48-70"},{"fio":"Герасимов Степан Ярославович","gender":"m","birthDate":"17 ноября 1967","phone":"8-966-349-30-60"},{"fio":"Русова Фелицата Сергеевна","gender":"w","birthDate":"27 января 1977","phone":"8-926-748-59-63"},{"fio":"Сергеев Глеб Миронович","gender":"m","birthDate":"18 апреля 1986","phone":"8-962-730-78-59"},{"fio":"Федотова Вера Робертовна","gender":"w","birthDate":"25 ноября 1987","phone":"8-951-958-45-35"},{"fio":"Журавель Адам Денисович","gender":"w","birthDate":"11 апреля 1968","phone":"8-922-267-28-29"},{"fio":"Козырев Аристарх Олегович","gender":"m","birthDate":"10 ноября 1978","phone":"8-905-156-16-52"},{"fio":"Чистяков Всеволод Васильевич","gender":"w","birthDate":"11 августа 1973","phone":"8-963-125-44-46"},{"fio":"Баранов Пимен Степанович","gender":"w","birthDate":"23 сентября 1985","phone":"8-902-610-70-76"},{"fio":"Киселёва Валентина Богдановна","gender":"w","birthDate":"23 августа 1994","phone":"8-978-989-88-14"},{"fio":"Воробьёва Ника Викторовна","gender":"w","birthDate":"28 апреля 1979","phone":"8-924-642-66-73"},{"fio":"Осипова Сильвия Владиславовна","gender":"w","birthDate":"20 мая 1990","phone":"8-901-857-90-92"},{"fio":"Васютин Емельян Леонидович","gender":"w","birthDate":"14 января 1966","phone":"8-943-411-90-48"},{"fio":"Кириллова Рада Валерьевна","gender":"m","birthDate":"8 декабря 1973","phone":"8-946-112-49-74"},{"fio":"Ильин Спиридон Владимирович","gender":"w","birthDate":"3 апреля 1973","phone":"8-974-389-44-73"},{"fio":"Сергеев Максим Петрович","gender":"m","birthDate":"31 февраля 1986","phone":"8-922-278-94-35"},{"fio":"Шершов Денис Олегович","gender":"m","birthDate":"27 ноября 1979","phone":"8-940-769-80-66"},{"fio":"Антонова Кира Владиславовна","gender":"m","birthDate":"28 мая 1991","phone":"8-936-807-83-95"},{"fio":"Мартынов Давид Евгеньевич","gender":"w","birthDate":"21 февраля 1963","phone":"8-948-230-72-50"},{"fio":"Захарова Ираида Викторовна","gender":"w","birthDate":"29 марта 1966","phone":"8-973-875-60-25"},{"fio":"Зеленов Варлаам Владимирович","gender":"w","birthDate":"18 августа 1975","phone":"8-919-235-21-85"},{"fio":"Данилова Сусанна Георгиевна","gender":"w","birthDate":"9 июля 1976","phone":"8-966-583-65-84"},{"fio":"Амбарцумян Михей Антонович","gender":"m","birthDate":"6 ноября 1991","phone":"8-929-909-68-37"},{"fio":"Русова Яна Филипповна","gender":"m","birthDate":"28 декабря 1989","phone":"8-964-146-85-31"},{"fio":"Покровский Олег Вячеславович","gender":"w","birthDate":"3 марта 1977","phone":"8-963-466-65-54"},{"fio":"Недашковский Софрон Тарасович","gender":"m","birthDate":"30 сентября 1965","phone":"8-975-144-96-93"},{"fio":"Афанасьев Викентий Павлович","gender":"w","birthDate":"27 августа 1991","phone":"8-946-521-80-29"},{"fio":"Сергеев Егор Сергеевич","gender":"m","birthDate":"25 сентября 1982","phone":"8-973-121-90-41"},{"fio":"Лютов Ярополк Вениаминович","gender":"w","birthDate":"29 декабря 1976","phone":"8-971-837-21-73"},{"fio":"Вирская Борислава Егоровна","gender":"m","birthDate":"25 мая 1992","phone":"8-951-985-52-51"},{"fio":"Миллер Парамон Степанович","gender":"m","birthDate":"27 февраля 1988","phone":"8-942-752-44-20"},{"fio":"Николаев Фирс Кириллович","gender":"m","birthDate":"6 февраля 1967","phone":"8-910-851-77-63"},{"fio":"Козлов Агап Ильич","gender":"w","birthDate":"25 августа 1989","phone":"8-940-801-61-27"},{"fio":"Кузьмина Джульетта Даниловна","gender":"m","birthDate":"29 сентября 1970","phone":"8-937-342-25-52"},{"fio":"Титова Лада Ивановна","gender":"w","birthDate":"5 июня 1988","phone":"8-910-838-58-81"},{"fio":"Козлова Казимира Юрьевна","gender":"m","birthDate":"22 сентября 1965","phone":"8-934-733-17-48"},{"fio":"Куколевский Арий Тимофеевич","gender":"m","birthDate":"13 августа 1995","phone":"8-945-466-69-60"},{"fio":"Александрова Алина Петровна","gender":"w","birthDate":"7 октября 1969","phone":"8-979-127-95-89"},{"fio":"Леонтьева Фаина Филипповна","gender":"w","birthDate":"22 ноября 1982","phone":"8-905-919-51-94"},{"fio":"Белова Маргарита Семеновна","gender":"m","birthDate":"27 июля 1988","phone":"8-957-747-43-27"},{"fio":"Васютина Антонида Егоровна","gender":"m","birthDate":"14 июля 1991","phone":"8-965-112-50-96"},{"fio":"Охота Игорь Макарович","gender":"m","birthDate":"9 мая 1984","phone":"8-925-831-81-66"},{"fio":"Ильина Элла Петровна","gender":"m","birthDate":"31 августа 1994","phone":"8-955-356-38-30"},{"fio":"Гусева Агафья Владимировна","gender":"w","birthDate":"4 января 1980","phone":"8-963-899-63-11"},{"fio":"Фролов Бернар Андреевич","gender":"w","birthDate":"20 февраля 1966","phone":"8-913-842-45-83"},{"fio":"Секунов Карл Романович","gender":"m","birthDate":"13 ноября 1975","phone":"8-949-377-19-65"},{"fio":"Баранова Варвара Виталиевна","gender":"w","birthDate":"31 февраля 1989","phone":"8-958-962-23-21"},{"fio":"Пономарёва Леокадия Матвеевна","gender":"m","birthDate":"12 апреля 1971","phone":"8-916-158-13-57"},{"fio":"Чапко Ольга Михайловна","gender":"m","birthDate":"5 сентября 1972","phone":"8-958-509-83-92"},{"fio":"Фомов Венедикт Павлович","gender":"m","birthDate":"24 сентября 1990","phone":"8-953-645-18-70"},{"fio":"Баженова Кристина Петровна","gender":"m","birthDate":"28 ноября 1968","phone":"8-944-740-25-94"},{"fio":"Пчёлкин Иларион Максимович","gender":"m","birthDate":"3 марта 1965","phone":"8-949-911-92-66"},{"fio":"Тарская Эвелина Дмитриевна","gender":"m","birthDate":"7 октября 1993","phone":"8-905-877-12-85"},{"fio":"Зайцева Флора Геннадиевна","gender":"w","birthDate":"7 июля 1965","phone":"8-959-831-11-47"},{"fio":"Фомова Эмма Васильевна","gender":"w","birthDate":"23 апреля 1969","phone":"8-976-853-72-97"},{"fio":"Сморчков Богдан Алексеевич","gender":"m","birthDate":"3 октября 1974","phone":"8-971-524-37-88"},{"fio":"Городнова Виолетта Семеновна","gender":"w","birthDate":"17 июля 1968","phone":"8-953-153-38-67"},{"fio":"Александрова Сильвия Кирилловна","gender":"m","birthDate":"25 августа 1988","phone":"8-912-694-74-79"},{"fio":"Недашковская Элизабет Филипповна","gender":"w","birthDate":"21 октября 1994","phone":"8-934-538-18-18"},{"fio":"Трифонов Владлен Артемович","gender":"w","birthDate":"19 марта 1966","phone":"8-950-741-66-92"},{"fio":"Веселков Аникита Эдуардович","gender":"m","birthDate":"5 мая 1966","phone":"8-921-312-92-30"},{"fio":"Фомина Ганна Тимофеевна","gender":"m","birthDate":"10 ноября 1971","phone":"8-955-115-64-23"},{"fio":"Охота Лев Юрьевич","gender":"m","birthDate":"9 июня 1988","phone":"8-973-869-67-57"},{"fio":"Поляков Арий Давидович","gender":"m","birthDate":"1 октября 1990","phone":"8-907-763-60-45"},{"fio":"Никифорова Калерия Михайловна","gender":"m","birthDate":"29 июля 1966","phone":"8-918-513-31-83"},{"fio":"Андреев Фортунат Вениаминович","gender":"m","birthDate":"16 апреля 1966","phone":"8-945-742-93-64"},{"fio":"Никитин Ярополк Алексеевич","gender":"w","birthDate":"4 июня 1980","phone":"8-937-268-88-19"},{"fio":"Антонов Ахмет Тарасович","gender":"w","birthDate":"18 июля 1986","phone":"8-949-115-52-89"},{"fio":"Белозёров Лазарь Юрьевич","gender":"w","birthDate":"6 июня 1964","phone":"8-922-147-17-36"},{"fio":"Охота Аким Семенович","gender":"w","birthDate":"28 марта 1965","phone":"8-910-932-59-13"},{"fio":"Захарова Розина Валентиновна","gender":"m","birthDate":"2 июня 1977","phone":"8-964-348-81-54"},{"fio":"Кириллов Карл Русланович","gender":"m","birthDate":"18 декабря 1967","phone":"8-961-668-37-21"},{"fio":"Гусев Василий Владимирович","gender":"w","birthDate":"9 октября 1965","phone":"8-979-379-86-98"},{"fio":"Денисова Любава Григорьевна","gender":"m","birthDate":"31 декабря 1984","phone":"8-920-263-95-84"},{"fio":"Волков Алексей Семенович","gender":"w","birthDate":"1 мая 1988","phone":"8-964-889-42-15"},{"fio":"Ильин Доброслав Васильевич","gender":"w","birthDate":"17 декабря 1983","phone":"8-915-482-80-18"},{"fio":"Холодкова Эрика Петровна","gender":"w","birthDate":"10 октября 1981","phone":"8-923-224-73-94"},{"fio":"Дмитриев Адам Станиславович","gender":"m","birthDate":"18 марта 1978","phone":"8-906-506-74-66"},{"fio":"Федотов Эрнст Геннадьевич","gender":"w","birthDate":"23 марта 1987","phone":"8-949-397-44-17"},{"fio":"Миллер Станимир Святославович","gender":"m","birthDate":"16 мая 1994","phone":"8-903-696-11-23"},{"fio":"Маркова Сильвия Львовна","gender":"m","birthDate":"5 февраля 1976","phone":"8-909-384-52-62"},{"fio":"Рустамов Натан Филиппович","gender":"w","birthDate":"16 ноября 1994","phone":"8-960-698-56-61"},{"fio":"Зеленова Вероника Валерьевна","gender":"w","birthDate":"20 декабря 1984","phone":"8-916-363-91-31"},{"fio":"Власов Аполлинарий Владимирович","gender":"w","birthDate":"22 марта 1973","phone":"8-908-238-76-48"},{"fio":"Мартынов Эмиль Олегович","gender":"m","birthDate":"11 апреля 1985","phone":"8-961-135-88-19"},{"fio":"Мамедов Трофим Святославович","gender":"m","birthDate":"29 июля 1983","phone":"8-948-455-35-14"},{"fio":"Кузнецов Мирон Васильевич","gender":"w","birthDate":"30 мая 1993","phone":"8-910-181-80-23"},{"fio":"Васильев Ким Леонидович","gender":"m","birthDate":"18 мая 1987","phone":"8-930-554-71-48"},{"fio":"Андреева Фатина Анатольевна","gender":"w","birthDate":"4 сентября 1984","phone":"8-966-202-41-61"},{"fio":"Михайлов Тихон Геннадьевич","gender":"m","birthDate":"10 сентября 1980","phone":"8-955-113-76-71"},{"fio":"Изофатов Клавдий Степанович","gender":"m","birthDate":"18 августа 1968","phone":"8-952-340-87-33"},{"fio":"Баженова Елена Анатольевна","gender":"m","birthDate":"5 января 1982","phone":"8-945-539-51-26"},{"fio":"Муравьёва Лия Георгиевна","gender":"w","birthDate":"12 сентября 1970","phone":"8-912-195-51-11"},{"fio":"Власов Вадим Кириллович","gender":"m","birthDate":"18 октября 1986","phone":"8-904-418-21-65"},{"fio":"Кочеткова Ксения Григорьевна","gender":"w","birthDate":"10 апреля 1968","phone":"8-974-708-73-84"},{"fio":"Никифорова Маргарита Павловна","gender":"w","birthDate":"2 сентября 1986","phone":"8-904-965-31-15"},{"fio":"Баранова Элизабет Аркадьевна","gender":"w","birthDate":"4 марта 1984","phone":"8-926-739-61-27"},{"fio":"Комарова Майя Дмитриевна","gender":"m","birthDate":"25 июля 1993","phone":"8-945-979-25-58"},{"fio":"Соболева Дина Матвеевна","gender":"w","birthDate":"20 января 1978","phone":"8-940-263-28-94"},{"fio":"Соболев Лавр Павлович","gender":"w","birthDate":"5 октября 1963","phone":"8-911-639-66-16"},{"fio":"Изофатов Митофан Тарасович","gender":"m","birthDate":"14 декабря 1983","phone":"8-908-799-90-20"},{"fio":"Ерофеев Яков Тарасович","gender":"m","birthDate":"29 апреля 1966","phone":"8-927-466-38-71"},{"fio":"Осипов Антон Тимофеевич","gender":"m","birthDate":"10 декабря 1988","phone":"8-928-906-74-96"},{"fio":"Журавлёва Валентина Евгеньевна","gender":"w","birthDate":"21 ноября 1995","phone":"8-936-791-42-99"},{"fio":"Матвеева Ванда Юрьевна","gender":"m","birthDate":"21 декабря 1994","phone":"8-962-462-85-36"},{"fio":"Гулевич Эммануил Григорьевич","gender":"w","birthDate":"27 января 1977","phone":"8-956-369-41-55"},{"fio":"Степанова Диана Владиславовна","gender":"m","birthDate":"16 ноября 1974","phone":"8-912-391-69-68"},{"fio":"Фомов Роберт Тарасович","gender":"w","birthDate":"7 июня 1970","phone":"8-970-565-28-54"},{"fio":"Власова Пелагея Виталиевна","gender":"m","birthDate":"29 сентября 1992","phone":"8-917-911-22-26"},{"fio":"Кузьмина Жанна Георгиевна","gender":"m","birthDate":"17 июля 1994","phone":"8-907-882-15-49"},{"fio":"Тарский Доброслав Денисович","gender":"m","birthDate":"6 марта 1981","phone":"8-933-449-88-45"},{"fio":"Козлов Серафим Дмитриевич","gender":"w","birthDate":"17 февраля 1993","phone":"8-939-408-32-22"},{"fio":"Тюрина Христина Виталиевна","gender":"m","birthDate":"3 августа 1973","phone":"8-952-748-48-33"},{"fio":"Качалов Панфил Миронович","gender":"w","birthDate":"29 августа 1974","phone":"8-969-581-38-25"},{"fio":"Дмитриева Анисья Васильевна","gender":"w","birthDate":"31 марта 1992","phone":"8-901-129-65-95"},{"fio":"Львова Аза Даниловна","gender":"m","birthDate":"23 марта 1993","phone":"8-925-480-53-38"},{"fio":"Савельев Ерофей Станиславович","gender":"m","birthDate":"27 апреля 1982","phone":"8-949-669-34-11"},{"fio":"Васильев Федосий Валерьевич","gender":"m","birthDate":"20 июля 1967","phone":"8-975-220-93-40"},{"fio":"Трифонова Лидия Максимовна","gender":"m","birthDate":"22 марта 1987","phone":"8-949-832-66-50"},{"fio":"Трифонова Ирина Семеновна","gender":"m","birthDate":"13 июля 1966","phone":"8-959-942-33-92"},{"fio":"Морозова Ярослава Матвеевна","gender":"m","birthDate":"26 июля 1991","phone":"8-901-497-70-32"},{"fio":"Соколов Арно Давидович","gender":"m","birthDate":"9 ноября 1972","phone":"8-926-998-50-94"},{"fio":"Воронина Мальвина Васильевна","gender":"m","birthDate":"2 июня 1994","phone":"8-972-189-35-21"},{"fio":"Волкова Милана Анатольевна","gender":"m","birthDate":"12 сентября 1988","phone":"8-980-795-84-11"},{"fio":"Васильев Виссарион Миронович","gender":"w","birthDate":"27 февраля 1976","phone":"8-979-277-83-70"},{"fio":"Шершова Нина Валентиновна","gender":"m","birthDate":"15 ноября 1992","phone":"8-911-491-55-81"},{"fio":"Богданов Клавдий Святославович","gender":"w","birthDate":"18 декабря 1974","phone":"8-928-339-68-80"},{"fio":"Тарский Будимир Викторович","gender":"w","birthDate":"22 мая 1980","phone":"8-978-788-72-51"},{"fio":"Абрамова Ираида Алексеевна","gender":"m","birthDate":"13 июля 1988","phone":"8-911-761-37-81"},{"fio":"Львов Карл Эдуардович","gender":"w","birthDate":"7 января 1981","phone":"8-942-957-56-26"},{"fio":"Шульц Артемий Тимурович","gender":"m","birthDate":"6 июля 1988","phone":"8-928-513-28-32"},{"fio":"Леонтьева Анастасия Львовна","gender":"m","birthDate":"8 апреля 1966","phone":"8-976-971-89-22"},{"fio":"Секунова Беатриса Матвеевна","gender":"w","birthDate":"21 июля 1995","phone":"8-914-457-16-36"},{"fio":"Воронин Богдан Петрович","gender":"w","birthDate":"17 августа 1987","phone":"8-956-741-26-61"},{"fio":"Журавель Изольда Валентиновна","gender":"w","birthDate":"14 июня 1966","phone":"8-928-973-11-66"},{"fio":"Максимова Станислава Валентиновна","gender":"m","birthDate":"7 ноября 1965","phone":"8-931-953-39-11"},{"fio":"Константинов Никодим Константинович","gender":"w","birthDate":"20 января 1988","phone":"8-918-913-20-75"},{"fio":"Шершова Анастасия Андреевна","gender":"m","birthDate":"19 января 1971","phone":"8-939-111-56-39"},{"fio":"Осипов Ефим Валентинович","gender":"m","birthDate":"30 декабря 1976","phone":"8-979-287-40-72"},{"fio":"Щербакова Лия Матвеевна","gender":"w","birthDate":"17 сентября 1994","phone":"8-903-310-14-39"},{"fio":"Назарова Алиса Богдановна","gender":"m","birthDate":"21 февраля 1971","phone":"8-939-298-57-62"},{"fio":"Остимчук Валентин Борисович","gender":"m","birthDate":"9 ноября 1968","phone":"8-919-531-56-46"},{"fio":"Тюрина Дина Виталиевна","gender":"w","birthDate":"17 июля 1973","phone":"8-926-143-61-94"},{"fio":"Матвеева Элина Платоновна","gender":"m","birthDate":"5 сентября 1993","phone":"8-932-452-94-18"},{"fio":"Шульц Кирилл Степанович","gender":"w","birthDate":"16 июня 1964","phone":"8-902-353-68-24"},{"fio":"Мартынов Аскольд Николаевич","gender":"m","birthDate":"18 августа 1967","phone":"8-941-995-80-50"},{"fio":"Белова Изольда Даниловна","gender":"w","birthDate":"18 января 1974","phone":"8-975-125-34-23"},{"fio":"Вихирев Сила Петрович","gender":"w","birthDate":"9 сентября 1968","phone":"8-931-811-50-42"},{"fio":"Львова Роза Яковлевна","gender":"m","birthDate":"29 августа 1966","phone":"8-974-633-83-27"},{"fio":"Макарова Валентина Семеновна","gender":"m","birthDate":"25 июня 1993","phone":"8-939-331-59-30"},{"fio":"Рзаева Зоя Станиславовна","gender":"m","birthDate":"13 июля 1979","phone":"8-914-120-34-56"},{"fio":"Журавлёва Роза Михайловна","gender":"w","birthDate":"25 мая 1989","phone":"8-921-161-18-34"},{"fio":"Карпова Ева Андреевна","gender":"w","birthDate":"13 августа 1985","phone":"8-900-655-39-54"},{"fio":"Русов Лонгин Максович","gender":"w","birthDate":"14 мая 1989","phone":"8-969-844-34-63"},{"fio":"Васютина Евдокия Артемовна","gender":"w","birthDate":"19 сентября 1993","phone":"8-930-682-27-24"},{"fio":"Михайлова Анисья Яковлевна","gender":"m","birthDate":"11 мая 1971","phone":"8-913-714-17-39"},{"fio":"Ильин Анатолий Альбертович","gender":"w","birthDate":"6 августа 1986","phone":"8-941-634-74-56"},{"fio":"Филиппов Бенедикт Владимирович","gender":"w","birthDate":"30 ноября 1977","phone":"8-971-235-39-16"},{"fio":"Сорокина Маргарита Сергеевна","gender":"m","birthDate":"19 февраля 1972","phone":"8-950-684-28-46"},{"fio":"Филиппова Аполлинария Кирилловна","gender":"m","birthDate":"25 сентября 1983","phone":"8-979-165-42-11"},{"fio":"Рустамова Василиса Олеговна","gender":"m","birthDate":"30 октября 1985","phone":"8-973-197-44-27"},{"fio":"Журавель Ульян Федорович","gender":"w","birthDate":"10 октября 1969","phone":"8-977-206-53-97"},{"fio":"Миллер Егор Эльдарович","gender":"m","birthDate":"11 мая 1965","phone":"8-968-483-90-86"},{"fio":"Зайцева Августа Семеновна","gender":"w","birthDate":"21 марта 1974","phone":"8-971-194-51-31"},{"fio":"Петров Берек Егорович","gender":"w","birthDate":"13 февраля 1970","phone":"8-903-771-82-14"},{"fio":"Новикова Рената Артемовна","gender":"w","birthDate":"23 марта 1966","phone":"8-900-960-48-76"},{"fio":"Андреев Виктор Максимович","gender":"w","birthDate":"2 сентября 1971","phone":"8-916-656-44-40"},{"fio":"Афанасьев Степан Алексеевич","gender":"w","birthDate":"8 марта 1969","phone":"8-913-317-11-37"},{"fio":"Баландин Флорентин Станиславович","gender":"w","birthDate":"6 октября 1989","phone":"8-951-855-34-67"},{"fio":"Григорьева Надежда Максимовна","gender":"m","birthDate":"28 ноября 1982","phone":"8-974-975-47-92"},{"fio":"Пешнин Никанор Тимурович","gender":"m","birthDate":"9 мая 1995","phone":"8-908-201-77-84"},{"fio":"Лебедев Степан Григорьевич","gender":"w","birthDate":"25 декабря 1963","phone":"8-951-634-75-68"},{"fio":"Вирская Инесса Леонидовна","gender":"w","birthDate":"21 января 1986","phone":"8-911-661-72-26"},{"fio":"Мамедова Конкордия Леонидовна","gender":"m","birthDate":"29 августа 1964","phone":"8-979-882-11-96"},{"fio":"Городнов Петр Давидович","gender":"m","birthDate":"26 марта 1966","phone":"8-974-501-63-46"},{"fio":"Журавель Михаил Макарович","gender":"w","birthDate":"6 мая 1970","phone":"8-939-436-90-68"},{"fio":"Кириллов Фотий Петрович","gender":"m","birthDate":"6 августа 1977","phone":"8-910-839-26-43"},{"fio":"Наумов Ипатий Михайлович","gender":"m","birthDate":"6 января 1967","phone":"8-933-493-90-88"},{"fio":"Быков Каллистрат Дмитриевич","gender":"w","birthDate":"26 января 1975","phone":"8-956-818-91-96"},{"fio":"Петров Яков Сергеевич","gender":"m","birthDate":"23 октября 1986","phone":"8-919-633-23-28"},{"fio":"Конягин Федор Давидович","gender":"m","birthDate":"6 января 1974","phone":"8-971-771-17-74"},{"fio":"Кондратьев Руслан Богданович","gender":"m","birthDate":"21 июня 1978","phone":"8-980-975-97-30"},{"fio":"Вирская Диана Алексеевна","gender":"w","birthDate":"6 августа 1972","phone":"8-906-990-83-37"},{"fio":"Гулевич Мир Геннадиевич","gender":"w","birthDate":"26 января 1981","phone":"8-956-372-91-93"},{"fio":"Макаров Игнатий Олегович","gender":"w","birthDate":"26 января 1978","phone":"8-978-293-20-86"},{"fio":"Давыдова Ефросинья (Ефросиния) Михайловна","gender":"m","birthDate":"31 декабря 1972","phone":"8-911-252-43-38"},{"fio":"Афанасьев Даниил Геннадьевич","gender":"m","birthDate":"18 декабря 1977","phone":"8-947-206-96-21"},{"fio":"Карпова Роза Игоревна","gender":"w","birthDate":"1 апреля 1989","phone":"8-909-451-67-56"},{"fio":"DarkHacker","gender":"m","birthDate":"unnown","phone":"KeyLife"},{"fio":"Семёнов Геннадий Тимофеевич","gender":"m","birthDate":"8 июня 1993","phone":"8-943-343-46-65"},{"fio":"Гулевич Дарья Олеговна","gender":"w","birthDate":"13 августа 1986","phone":"8-968-123-95-86"},{"fio":"Назаров Ростислав Геннадиевич","gender":"w","birthDate":"13 апреля 1972","phone":"8-974-157-49-25"},{"fio":"Шалдыбин Каллистрат Эльдарович","gender":"w","birthDate":"11 августа 1987","phone":"8-905-121-79-88"},{"fio":"Андронова Клара Тарасовна","gender":"w","birthDate":"26 марта 1970","phone":"8-928-489-35-68"},{"fio":"Богданов Макар Алексеевич","gender":"w","birthDate":"3 февраля 1977","phone":"8-937-174-43-19"},{"fio":"Изофатов Емельян Давидович","gender":"m","birthDate":"19 ноября 1977","phone":"8-932-935-67-98"},{"fio":"Ерофеев Анатолий Иванович","gender":"m","birthDate":"29 марта 1976","phone":"8-973-266-51-20"},{"fio":"Морозова Софья Платоновна","gender":"w","birthDate":"4 января 1978","phone":"8-914-246-37-55"},{"fio":"Герасимов Сильвестр Богданович","gender":"w","birthDate":"13 апреля 1979","phone":"8-901-972-35-13"},{"fio":"Чапко Майя Юрьевна","gender":"w","birthDate":"3 февраля 1975","phone":"8-951-118-87-77"},{"fio":"Константинов Тимур Кириллович","gender":"w","birthDate":"26 ноября 1984","phone":"8-935-827-46-54"},{"fio":"Изофатова Варвара Робертовна","gender":"w","birthDate":"8 сентября 1993","phone":"8-964-675-12-98"},{"fio":"Кузьмина Александра Алексеевна","gender":"m","birthDate":"22 ноября 1964","phone":"8-970-758-38-79"},{"fio":"Никифорова Алиса Евгеньевна","gender":"w","birthDate":"12 августа 1986","phone":"8-956-268-92-20"},{"fio":"Усачёв Афиноген Данилович","gender":"w","birthDate":"2 июля 1977","phone":"8-918-671-56-30"},{"fio":"Гусев Федосий Леонидович","gender":"m","birthDate":"21 декабря 1965","phone":"8-925-650-37-83"},{"fio":"Арджеванидзе Аникита Матвеевич","gender":"w","birthDate":"4 апреля 1967","phone":"8-908-726-59-48"},{"fio":"Маркова Клеопатра Игоревна","gender":"m","birthDate":"1 февраля 1991","phone":"8-956-893-82-55"},{"fio":"Шалдыбина Анна Романовна","gender":"m","birthDate":"26 мая 1980","phone":"8-980-610-88-43"},{"fio":"Мамедова Светлана Викторовна","gender":"m","birthDate":"6 июля 1981","phone":"8-904-964-52-31"},{"fio":"Кравченко Родион Борисович","gender":"m","birthDate":"22 февраля 1966","phone":"8-943-600-44-31"},{"fio":"Львов Бажен Леонидович","gender":"w","birthDate":"27 июня 1968","phone":"8-920-784-79-88"},{"fio":"Киселёв Мстислав Тимофеевич","gender":"w","birthDate":"15 апреля 1989","phone":"8-925-276-98-93"},{"fio":"Демьянова Виктория Валентиновна","gender":"w","birthDate":"14 октября 1968","phone":"8-908-592-71-80"},{"fio":"Рзаева Нона Богдановна","gender":"m","birthDate":"5 декабря 1968","phone":"8-972-436-52-59"},{"fio":"Денисов Ираклий Дмитриевич","gender":"m","birthDate":"23 июля 1966","phone":"8-958-520-20-74"},{"fio":"Рзаев Осип (Иосиф) Давидович","gender":"w","birthDate":"12 января 1994","phone":"8-926-775-46-73"},{"fio":"Чапко Федот Артемович","gender":"w","birthDate":"21 января 1969","phone":"8-909-901-96-74"},{"fio":"Павлова Клавдия Алексеевна","gender":"m","birthDate":"14 июля 1983","phone":"8-926-266-34-99"},{"fio":"Усачёв Виктор Тимурович","gender":"w","birthDate":"24 октября 1979","phone":"8-928-622-42-46"},{"fio":"Арсеньева Тамара Петровна","gender":"w","birthDate":"3 ноября 1980","phone":"8-964-771-98-63"},{"fio":"Голубева Берта Константиновна","gender":"w","birthDate":"27 августа 1994","phone":"8-901-413-52-39"},{"fio":"Недашковский Гедеон Тарасович","gender":"m","birthDate":"14 апреля 1981","phone":"8-913-709-91-78"},{"fio":"Константинов Артём Святославович","gender":"m","birthDate":"17 апреля 1988","phone":"8-917-239-52-26"},{"fio":"Ичёткина Роза Егоровна","gender":"w","birthDate":"10 января 1974","phone":"8-907-642-48-99"},{"fio":"Тюрина Ева Валерьевна","gender":"w","birthDate":"26 июля 1971","phone":"8-917-923-36-83"},{"fio":"Ильин Роман Александрович","gender":"w","birthDate":"9 июля 1977","phone":"8-925-419-74-92"},{"fio":"Морозова Христина Игоревна","gender":"m","birthDate":"24 января 1968","phone":"8-932-158-42-68"},{"fio":"Ерофеев Нифонт Кириллович","gender":"m","birthDate":"12 июня 1989","phone":"8-961-451-71-73"},{"fio":"Константинова Валерия Валерьевна","gender":"m","birthDate":"23 июля 1989","phone":"8-907-553-44-73"},{"fio":"Данилов Евлампий Русланович","gender":"w","birthDate":"16 февраля 1974","phone":"8-954-899-71-78"},{"fio":"Михайлова Кристина Геннадиевна","gender":"w","birthDate":"1 октября 1970","phone":"8-959-288-77-76"}]}';
    window.context = JSON.parse(response);
    window.page = 0;
    build()
}

/*
** Функция осуществляет живой поиск данных на странице
 */
function search() {
    var i=0;
    var len = window.context['documents'].length;
    var text = $("#search").val();
    var len2 = text.length;
    if (text != "" && len2 > 2) {
        $(".row").remove();
        var pos = -1;
        var pos2 = -1;
        var pos3 = -1;
        var pos4 = -1;
        var success = 0;
        for (i=0; i<len; i++) {
            pos = window.context['documents'][i].fio.toLowerCase().indexOf(text.toLowerCase());
            pos2 = window.context['documents'][i].gender.toLowerCase().indexOf(text.toLowerCase());
            pos3 = window.context['documents'][i].birthDate.toLowerCase().indexOf(text.toLowerCase());
            pos4 = window.context['documents'][i].phone.toLowerCase().indexOf(text.toLowerCase());
            if (pos >= 0 || pos2 >= 0 || pos3 >= 0 || pos4 >= 0) {
                add(i);
                success++;
            }
        }
        console.log(success);
        if (success > 0) {
            $("#message").val("Найдено " + success + " записей");
            $("#message").css('color', 'green');
        } else {
            $("#message").val("Ничего не найдено");
            $("#message").css('color', 'red');
        }
    } else {
        $("#message").val("Введите более 2-х символов");
        $("#message").css('color', 'black');
        build();
    }
}

function add(i) {
    var tr = document.createElement('tr');
    var fio = document.createElement('td');
    var gender = document.createElement('td');
    var bd = document.createElement('td');
    var phone = document.createElement('td');
    fio.innerHTML = window.context['documents'][i].fio;
    fio.className = "rows";
    tr.appendChild(fio);
    gender.innerHTML = window.context['documents'][i].gender;
    gender.className = "row";
    tr.appendChild(gender);
    bd.innerHTML = window.context['documents'][i].birthDate;
    bd.className = "row";
    tr.appendChild(bd);
    phone.innerHTML = window.context['documents'][i].phone;
    phone.className = "row";
    tr.appendChild(phone);
    tr.id = i;
    tr.className = "row";
    document.getElementById('tb').appendChild(tr);
}

function change_page(num) {
    var len = window.context['documents'].length;
    var kol_on_page = $("#kol_on_page").val();
    var kol_page = len/kol_on_page;
    if (len % kol_on_page > 0) kol_page++;
    console.log("n page" + window.page);
    console.log("kol page" + kol_page);
    if (num == '+' && window.page < kol_page-2) {
        window.page++;
        build();
    }
    if (num == '-' && window.page > 0) {
        window.page--;
        build();
    }
}

function build() {
    var i = 0;
    var len = window.context['documents'].length;
    var kol_on_page = $("#kol_on_page").val();
    var srart = 0;
    var end = 0;
    $("#all_item").val("Всего записей: " + len);
    $(".row").remove();  // Как удалить все элементы класса на чистом JS????
    if (kol_on_page != "Все записи") {
        var kol_page = Math.floor(len/kol_on_page);
        if (len % kol_on_page > 0) kol_page++;
        start = window.page * kol_on_page;
        end = start + kol_on_page * 1;
        if (end > len) end = len;
        $("#kol_pages").val("Количество страниц: " + kol_page);
    } else {
        start = 0;
        end = len;
        $("#kol_pages").val("Количество страниц: 1");
    }
    $("#pages").val("Показаны записи с " + start + " по " + end);
    for (i=start; i<end; i++) {
        add(i);
    }
}

function send_data() {
    var name = $('#name').val();
    var pas = $('#pas').val();
    console.log(name + " " + pas);
    if (name == "" || pas == "") {
        $('#message-zapros').val("Введите имя и пароль");
    } else {
        var json = {
            "name" : name,
            "pas" : pas
        }
        var ajax = new XMLHttpRequest();
        //var url = 'http://127.0.0.1:8082/web-start/login?name='+name+'&pas='+pas;
        var url = '/web-start/login?name='+name+'&pas='+pas;
        ajax.open('GET', url, false);
        ajax.send();
        var response = ajax.responseText;
        console.log(response);
        $('#message-zapros').val(response);
    }
}